# Pandas

## Series

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [ ]:
label = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [ ]:
#Creating a series (1st way)
pd.Series(data = my_data)

In [ ]:
#You can give index values to your data in series
print(pd.Series(data = my_data, index = label))
#And you can write like this too
print(pd.Series(my_data, label))

In [ ]:
pd.Series([1,2,3,4],['aloo','aandy','pyazz','lassan'])

In [ ]:
#You can pass a numpy array to series function
pd.Series(arr,label)

In [ ]:
#You can pass dictionary and pandas will take key's as index and values as values
pd.Series(d)

In [ ]:
#Pnadas series can store almost everykind of data such as integers and strings etc. 
#even you can save built-in functions as data
pd.Series(data=[sum,print,len])

In [ ]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','SSSR','France'])

In [ ]:
ser2 = pd.Series([1,2,5,4],['USA','italy','SSSR','France'])

In [ ]:
#Picking a value
ser1['USA']

In [ ]:
ser2['SSSR']

In [ ]:
#Adding
ser1 + ser2

## DataFrames

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [ ]:
#Creating a DataFrame
# It will take 3 parameters first is data, 2nd is row labels and 3rd is coulmn names
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['w','x','y','z'])

In [5]:
#We can create a DataFrame from dictionary too
xz = {'n':[1,2,3],'v':[4,5,6],'r':[7,8,9]}
t = pd.DataFrame(xz)
t

   n  v  r
0  1  4  7
1  2  5  8
2  3  6  9

In [ ]:
#Another Way in which we can declare index too
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

In [ ]:
# each coulmn is a pandas series
df

### Indexing and selection in DataFrame

In [ ]:
#Picking a coulmn
df['w']

In [ ]:
#You can Check type of w which is a series 
type(df['w'])

In [ ]:
#If you want multiple coulmns you can pass an array of coulmn names in df[]
df[['w','x']]

In [ ]:
#arthematic operation/ adding new coulmn
df['j'] = df['x'] + df['y']
df

In [ ]:
#Deleting a coulmn
#axis =1 for selecting coulmn
#Inplace s true bcoz we want that row permanently deleted form table
df.drop('j',axis=1,inplace=True)

In [ ]:
df

In [ ]:
#Droping Row
#We will not use axis = 0 because it is default
#Without inplace data will not be deleated from origional table
df.drop('E')

In [ ]:
df.shape

In [ ]:
#Picking the rows from table
#as like coulmns, rows are series too
#There are two ways 
df.loc['C']

In [ ]:
#2nd way
df.iloc[2]

In [ ]:
#Selecting subsets of rows and coulmns
#Selecting one value from table
df.loc['B','y']

In [ ]:
#Multiple Values from table
df.loc[['A','B'],['w','y']]

In [ ]:
df.loc[['D','E'],['x','z']]

### Conditional Selection and Multiple index

In [ ]:
#Checking if the value is bigger than 0
#That's how we will do this
df[df > 0]

In [ ]:
#Thats how it actually works
booldf = df > 0

In [ ]:
df[booldf]

In [ ]:
#Removing null value
df

In [ ]:
df['w'] > 0

In [ ]:
df['w']

In [ ]:
#The condition is where the condition (df['w']>0) is true show that part
#If in coulmn W values are bigger than zero show that part
df[df['w']> 0]

In [ ]:
#Here the condition is where z is lesser than zero show that part
df[df['z'] < 0]

In [ ]:
#You can store that conditional table for using for other purposes
resultdf = df[df['w']>0]

In [ ]:
# resultdf is now an independent table and youcan use it
resultdf['w']

In [ ]:
#Instead of storing a selections resyult in a veriable and 
#then calling a row from results you can do it in one step too
df[df['w']> 0]['x']

In [ ]:
#And you can do it with multiple coulmns
df[df['w']> 0][['y','x']]

In [ ]:
#You can add multiple conditions
#And condition
df[(df['w']> 0) & (df['y']> 1)]

In [ ]:
#or condition
df[(df['w']> 0) | (df['y']> 1)]

### Resetting index

In [ ]:
#It will convert you index to numerical form 0 to end
#if you wana save this settings set inplace=True in brackets
#Thye previous index will be a coulmn in your table which you can drop
df.reset_index()

In [ ]:
#New Index (New coulmn)
newind = 'CA NY WY OR CO'.split()
newind

In [ ]:
df['State'] = newind

In [ ]:
df

In [ ]:
#Setting an old coulmn as new index
#Inplace=True if you want permanent changes
df.set_index('State')

### Multi-Indexing and Hiering key

In [ ]:
#Index level
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
hier_index

In [ ]:
xc = pd.DataFrame(randn(6,2),hier_index,['A','B'])
xc

In [ ]:
xc.loc['G1']

In [ ]:
xc.loc['G1'].loc[1]

In [ ]:
xc.loc['G1'].loc[[1,3],['A','B']]

In [ ]:
xc.index.names = ['Groups','Num']
xc

In [ ]:
#Cross Section Selection xs()
xc.xs(1,level='Num')

## Missing Data

#### Drop Thrash Fill

In [ ]:
#Creating dataframe from dictionary
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[7,8,9]}

In [ ]:
dz = pd.DataFrame(d)

In [ ]:
dz

In [ ]:
#Dropping the rows which have null values
dz.dropna()

In [ ]:
#Dropping the coulmn which have null values
#For coulmn you have to define axis=1
dz.dropna(axis = 1)

In [ ]:
#Thresh
#Thresh is parameter who will define keep the row or coulmn 
#if it has equal to this number of non null values
dz.dropna(thresh=2)
#Now which row will have 2 non null values will not get dropped

In [ ]:
#Fill Values
dz.fillna(value="hello")

In [ ]:
#But you will not fill the values with string 
#instead you can fill with mean
dz['A'].fillna(value=dz['A'].mean())
#So we took a coulmn and filled its null value with its mean

### Groupby

In [ ]:
#Dictionary
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [ ]:
#Passing dictionary to dataframe
dl = pd.DataFrame(data)
dl

In [ ]:
#Groupping the data by company coulmn 
ss = dl.groupby('Company')

In [ ]:
# Now we can do some operation on data
ss.mean()
#Perso coulmn has string values and cant mean so pandas ignored it

In [ ]:
#We can oprate many funcs for example
ss.sum()

In [ ]:
ss.sum().loc['FB']

In [ ]:
#We can do grouing in one line too
dl.groupby('Company').sum().loc['FB']

In [ ]:
dl.groupby('Company').count()

In [ ]:
dl.groupby('Company').max()

In [ ]:
dl.groupby('Company').describe()

In [ ]:
dl.groupby('Company').describe().transpose()

In [ ]:
dl.groupby('Company').describe().transpose()['FB']

#### Merging, joining and concatenating

In [1]:
#From Notes
pd.concat([])
pd.concat([],axis=1)
#In big brackests you will enter dataframes to concat

NameError: name 'pd' is not defined

In [2]:
pd.merge(dataframe1,datframe2,on='coulmn name to merge on')

NameError: name 'pd' is not defined

### Operations

In [25]:
#Finding Unique values in DataFrame
dfs = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
dfs.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [11]:
dfs['col2'].unique()

array([444, 555, 666], dtype=int64)

In [12]:
#Nunique() is for how much unique values are there in coulmn
dfs['col2'].nunique()

3

In [14]:
#Show umique values with how many times they were in df
dfs['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

#### Apply Method

In [15]:
#If you wanna apply your own function to some coulmn of dataframe you can use this
def time2(x):
    return x*2

In [17]:
dfs

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [16]:
dfs['col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [18]:
#Length of each string in coulmn 3
dfs['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [20]:
#Apply function will be usefull in lambda expression
#We converted that time function in lambda expression
dfs['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [21]:
#End of Apply

In [25]:
dfs.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [26]:
dfs.index

RangeIndex(start=0, stop=4, step=1)

### Sorting And Ordering DataFrames

In [27]:
#Sorting 
dfs.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [28]:
#Checking if table have null values or not
dfs.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [31]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

dfx = pd.DataFrame(data)

In [32]:
dfx

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [34]:
dfx.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Data Input and Output

#### CSV, EXCEL, HTML, SQL

In [9]:
#Location of Jupyter Notebook
#Also our files should be in that folder where jupyter is installed

In [10]:
pwd

'C:\\Users\\Mubashar Ateeq'

##### CSV

In [16]:
#Reading CSV file from same location of jupyter
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [17]:
#Writing CSV
dc = pd.read_csv('example')
dc.to_csv('my_output', index=False)

In [18]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

##### EXCEL

In [9]:
#EXCEL Files
xl = pd.read_excel('Excel_Sample.xlsx', index_col=0)

In [11]:
# To write the excel file will store it as another file
xl.to_excel('Excel_sample2.xlsx',sheet_name='NewSheet')

In [12]:
pd.read_excel('Excel_Sample2.xlsx', index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [15]:
#Now you can perform action in xl
xl.drop(0)

    a   b   c   d
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

##### HTML

In [17]:
#Reading files from HTML
datta = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [21]:
datta[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

##### SQL

In [22]:
#Reading Sql files
from sqlalchemy import create_engine

In [23]:
engine = create_engine('sqlite:///:memory:')

In [26]:
#dfs is a dataframe which we created above
dfs.to_sql('my_table',engine)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [28]:
sqldfs = pd.read_sql('my_table',con=engine)

OperationalError: (sqlite3.OperationalError) near "my_table": syntax error
[SQL: my_table]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [29]:
sqldfs

NameError: name 'sqldfs' is not defined